In [1]:
import pandas as pd
from statsmodels.tsa.holtwinters import ExponentialSmoothing

In [2]:
# Load the decomposed data
df = pd.read_csv("eng_pp_9523_eda_pivoted.csv", index_col=0)

In [3]:
df.head()

,Year,Month,price,Old/New,Detached,Semi-detached,Terraced,Flat,Others,Street,Locality,Town/City,District,County
0,1995,February,44500,N,0,0,1,0,0,HOWICK PARK,SUNDERLAND,SUNDERLAND,SUNDERLAND,TYNE AND WEAR
1,1995,January,56500,N,0,0,1,0,0,BRICK KILN CLOSE,COGGESHALL,COLCHESTER,BRAINTREE,ESSEX
2,1995,July,58000,N,0,0,1,0,0,RAINSBROOK DRIVE,SHIRLEY,SOLIHULL,SOLIHULL,WEST MIDLANDS
3,1995,June,51000,N,0,1,0,0,0,MERRY HILL,BRIERLEY HILL,BRIERLEY HILL,DUDLEY,WEST MIDLANDS
4,1995,March,17000,N,0,0,1,0,0,DENMAN STREET,ROTHERHAM,ROTHERHAM,ROTHERHAM,SOUTH YORKSHIRE

In [4]:
# Combining Year and Month for date column
df['Date'] = pd.to_datetime(df['Year'].astype(str) + '-' + df['Month'].astype(str))
df.drop(['Year', 'Month'], axis=1, inplace=True)

In [5]:
df.set_index('Date', inplace=True)

In [6]:
#df2 = df.head()

In [7]:
df.head()

,price,Old/New,Detached,Semi-detached,Terraced,Flat,Others,Street,Locality,Town/City,District,County
Date,,,,,,,,,,,,
1995-02-01,44500,N,0,0,1,0,0,HOWICK PARK,SUNDERLAND,SUNDERLAND,SUNDERLAND,TYNE AND WEAR
1995-01-01,56500,N,0,0,1,0,0,BRICK KILN CLOSE,COGGESHALL,COLCHESTER,BRAINTREE,ESSEX
1995-07-01,58000,N,0,0,1,0,0,RAINSBROOK DRIVE,SHIRLEY,SOLIHULL,SOLIHULL,WEST MIDLANDS
1995-06-01,51000,N,0,1,0,0,0,MERRY HILL,BRIERLEY HILL,BRIERLEY HILL,DUDLEY,WEST MIDLANDS
1995-03-01,17000,N,0,0,1,0,0,DENMAN STREET,ROTHERHAM,ROTHERHAM,ROTHERHAM,SOUTH YORKSHIRE

In [40]:
ts_detached = df[['Detached']]

In [41]:
ts_detached.head()

            Detached
Date
1995-02-01         0
1995-01-01         0
1995-07-01         0
1995-06-01         0
1995-03-01         0

In [42]:
# Resample by month with sum aggreagation on 'Detached' column
df_resampled = df.resample('M')['Detached'].sum()

In [43]:
ts_detached = pd.DataFrame(df_resampled)

In [44]:
ts_detached.head()

            Detached
Date
1995-01-31      9473
1995-02-28      9667
1995-03-31     13431
1995-04-30     11929
1995-05-31     13169

In [45]:
ts_detached.to_csv('ts_detached.csv')

In [ ]:
#FOR SEMI-DETACHED

In [8]:
ts_sdetached = df[['Semi-detached']]

In [9]:
ts_sdetached.head()

            Semi-detached
Date
1995-02-01              0
1995-01-01              0
1995-07-01              0
1995-06-01              1
1995-03-01              0

In [10]:
# Resample by month with sum aggreagation on 'Detached' column
df_resampled = df.resample('M')['Semi-detached'].sum()

In [11]:
ts_sdetached = pd.DataFrame(df_resampled)

In [12]:
ts_sdetached

            Semi-detached
Date
1995-01-31          12952
1995-02-28          12989
1995-03-31          18219
1995-04-30          15159
1995-05-31          17353
...                   ...
2023-07-31          10661
2023-08-31          11280
2023-09-30           8327
2023-10-31           3381
2023-11-30           1456

[347 rows x 1 columns]

In [13]:
ts_sdetached.to_csv('ts_sdetached.csv')

In [ ]:
#FOR TERRACED

In [14]:
ts_terraced = df[['Terraced']]

In [16]:
ts_terraced.head()

            Terraced
Date
1995-02-01         1
1995-01-01         1
1995-07-01         1
1995-06-01         0
1995-03-01         1

In [17]:
# Resample by month with sum aggreagation on 'Detached' column
df_resampled = df.resample('M')['Terraced'].sum()

In [18]:
ts_terraced = pd.DataFrame(df_resampled)

In [19]:
ts_terraced.head()

            Terraced
Date
1995-01-31     13426
1995-02-28     13323
1995-03-31     18688
1995-04-30     15579
1995-05-31     17676

In [20]:
ts_terraced.to_csv('ts_terracced.csv')

In [40]:
# FOR FLATS

In [55]:
ts_flat = df[['Flat']]

In [56]:
# Resample by month with sum aggreagation on 'Detached' column
df_resampled = df.resample('M')['Flat'].sum()

ts_flat = pd.DataFrame(df_resampled)

In [57]:
ts_flat.to_csv('ts_flats.csv')

In [43]:
# FOR OTHERS

In [21]:
ts_others = df[['Others']]

In [23]:
ts_others.head()

            Others
Date
1995-02-01       0
1995-01-01       0
1995-07-01       0
1995-06-01       0
1995-03-01       0

In [24]:
# Resample by month with sum aggreagation on 'Detached' column
df_resampled = df.resample('M')['Others'].sum()

In [26]:
ts_others = pd.DataFrame(df_resampled)

In [28]:
ts_others.head()

            Others
Date
1995-01-31       1
1995-02-28       0
1995-03-31       0
1995-04-30       0
1995-05-31       1

In [29]:
ts_others.to_csv('ts_others.csv')